chapters = [
    {
        "title": "第1章_操作系统引论",
        "sections": [
            {"title": "1.1_操作系统的目标和作用", "start": 10, "end": 14},
            {"title": "1.2_操作系统的发展过程", "start": 14, "end": 22},
            {"title": "1.3_操作系统的基本特性", "start": 22, "end": 25},
            {"title": "1.4_操作系统的主要功能", "start": 25, "end": 31},
            {"title": "1.5_OS结构设计", "start": 31, "end": 40},
        ]
    },
    {
        "title": "第2章_进程的描述与控制",
        "sections": [
            {"title": "2.1_前趋图和程序执行", "start": 41, "end": 44},
            {"title": "2.2_进程的描述", "start": 44, "end": 51},
            {"title": "2.3_进程控制", "start": 51, "end": 56},
            {"title": "2.4_进程同步", "start": 56, "end": 69},
            {"title": "2.5_经典进程的同步问题", "start": 69, "end": 76},
            {"title": "2.6_进程通信", "start": 76, "end": 84},
            {"title": "2.7_线程的基本概念", "start": 84, "end": 88},
            {"title": "2.8_线程的实现", "start": 88, "end": 93},
        ]
    },
    {
        "title": "第3章_处理机调度与死锁",
        "sections": [
            {"title": "3.1_处理机调度的层次和调度算法的目标", "start": 94, "end": 96},
            {"title": "3.2_作业与作业调度", "start": 96, "end": 100},
            {"title": "3.3_进程调度", "start": 100, "end": 106},
            {"title": "3.4_实时调度", "start": 106, "end": 113},
            {"title": "3.5_死锁概述", "start": 113, "end": 117},
            {"title": "3.6_预防死锁", "start": 117, "end": 119},
            {"title": "3.7_避免死锁", "start": 119, "end": 124},
            {"title": "3.8_死锁的检测与解除", "start": 124, "end": 127},
        ]
    },
    {
        "title": "第4章_存储器管理",
        "sections": [
            {"title": "4.1_存储器的层次结构", "start": 129, "end": 131},
            {"title": "4.2_程序的装入和链接", "start": 131, "end": 135},
            {"title": "4.3_连续分配存储管理方式", "start": 135, "end": 144},
            {"title": "4.4_对换(Swapping)", "start": 144, "end": 147},
            {"title": "4.5_分页存储管理方式", "start": 147, "end": 154},
            {"title": "4.6_分段存储管理方式", "start": 154, "end": 161},
        ]
    },
    {
        "title": "第5章_虚拟存储器",
        "sections": [
            {"title": "5.1_虚拟存储器概述", "start": 162, "end": 166},
            {"title": "5.2_请求分页存储管理方式", "start": 166, "end": 171},
            {"title": "5.3_页面置换算法", "start": 171, "end": 178},
            {"title": "5.4_抖动与工作集", "start": 178, "end": 181},
            {"title": "5.5_请求分段存储管理方式", "start": 181, "end": 186},
        ]
    },
    {
        "title": "第6章_输入输出系统",
        "sections": [
            {"title": "6.1_IO系统的功能、模型和接口", "start": 187, "end": 192},
            {"title": "6.2_IO设备和设备控制器", "start": 192, "end": 198},
            {"title": "6.3_中断机构和中断处理程序", "start": 198, "end": 201},
            {"title": "6.4_设备驱动程序", "start": 201, "end": 207},
            {"title": "6.5_与设备无关的IO软件", "start": 207, "end": 213},
            {"title": "6.6_用户层的IO软件", "start": 213, "end": 217},
            {"title": "6.7_缓冲区管理", "start": 217, "end": 223},
            {"title": "6.8_磁盘存储器的性能和调度", "start": 223, "end": 229},
        ]
    },
    {
        "title": "第7章_文件管理",
        "sections": [
            {"title": "7.1_文件的和文件系统", "start": 230, "end": 235},
            {"title": "7.2_文件的逻辑结构", "start": 235, "end": 241},
            {"title": "7.3_文件目录", "start": 241, "end": 249},
            {"title": "7.4_文件共享", "start": 249, "end": 252},
            {"title": "7.5_文件保护", "start": 252, "end": 258},
        ]
    },
    {
        "title": "第8章_磁盘存储器的管理",
        "sections": [
            {"title": "8.1_外存的组织方式", "start": 259, "end": 268},
            {"title": "8.2_文件存储空间的管理", "start": 268, "end": 272},
            {"title": "8.3_提高磁盘I/O速度的途径", "start": 272, "end": 276},
            {"title": "8.4_提高磁盘可靠性的技术", "start": 276, "end": 279},
            {"title": "8.5_数据一致性控制", "start": 279, "end": 285},
        ]
    },
    {
        "title": "第9章_操作系统接口",
        "sections": [
            {"title": "9.1_用户接口", "start": 286, "end": 291},
            {"title": "9.2_Shell命令语言", "start": 291, "end": 297},
            {"title": "9.3_联机命令接口的实现", "start": 297, "end": 302},
            {"title": "9.4_系统调用的概念和类型", "start": 302, "end": 306},
            {"title": "9.4_UNIX系统调用", "start": 306, "end": 309},
            {"title": "9.4_系统调用的实现", "start": 309, "end": 315},

        ]
    },
    {
        "title": "第10章_多处理机操作系统",
        "sections": [
            {"title": "10.1_多处理机系统的基本概念", "start": 316, "end": 318},
            {"title": "10.2_多处理机系统的结构", "start": 318, "end": 324},
            {"title": "10.3_多处理机操作系统的特征与分类", "start": 324, "end": 328},
            {"title": "10.4_进程同步", "start": 328, "end": 335},
            {"title": "10.5_多处理机操作系统的进程调度", "start": 335, "end": 342},
            {"title": "10.6_网络操作系统", "start": 342, "end": 348},
            {"title": "10.7_分布式文件系统", "start": 348, "end": 356},
        ]
    },
    {
        "title": "第11章_多媒体操作系统",
        "sections": [
            {"title": "11.1_多媒体系统简介", "start": 357, "end": 362},
            {"title": "11.2_多媒体文件中的各种媒体", "start": 362, "end": 365},
            {"title": "11.3_多媒体进程管理中的问题和接纳控制", "start": 365, "end": 370},
            {"title": "11.4_多媒体实时调度", "start": 370, "end": 374},
            {"title": "11.5_媒体服务器的特征和接纳控制", "start": 374, "end": 377},
            {"title": "11.6_多媒体存储器的分配方法", "start": 377, "end": 384},
            {"title": "11.7_高速缓存与磁盘调度", "start": 384, "end": 388},

        ]
    },
    {
        "title": "第12章_保护和安全",
        "sections": [
            {"title": "12.1_安全环境", "start": 389, "end": 392},
            {"title": "12.2_数据加密技术", "start": 392, "end": 396},
            {"title": "12.3_用户验证", "start": 396, "end": 401},
            {"title": "12.4_来自系统内部的攻击", "start": 401, "end": 405},
            {"title": "12.5_来自系统外部的攻击", "start": 405, "end": 410},
            {"title": "12.6_可信系统(Trusted System)", "start": 410, "end": 415},
        ]
    }
]
